# Introduction to Pandas Lab

Complete the following set of exercises to solidify your knowledge of Pandas fundamentals.

### 1. Import Numpy and Pandas and alias them to `np` and `pd` respectively.

In [1]:
import pandas as pd
import numpy as np

### 2. Create a Pandas Series containing the elements of the list below.

In [3]:
lst = [5.7, 75.2, 74.4, 84.0, 66.5, 66.3, 55.8, 75.7, 29.1, 43.7]

In [4]:
ser = pd.Series(lst)
print(ser)

0     5.7
1    75.2
2    74.4
3    84.0
4    66.5
5    66.3
6    55.8
7    75.7
8    29.1
9    43.7
dtype: float64

### 3. Use indexing to return the third value in the Series above.

*Hint: Remember that indexing begins at 0.*

In [5]:
ser[2]

74.4

### 4. Create a Pandas DataFrame from the list of lists below. Each sublist should be represented as a row.

In [6]:
b = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

In [8]:
dataframe_original = pd.DataFrame(b)
print(dataframe_original)

      0     1     2     3     4
0  53.1  95.0  67.5  35.0  78.4
1  61.3  40.8  30.8  37.8  87.6
2  20.6  73.2  44.2  14.6  91.8
3  57.4   0.1  96.1   4.2  69.5
4  83.6  20.5  85.4  22.8  35.9
5  49.0  69.0   0.1  31.8  89.1
6  23.3  40.7  95.0  83.8  26.9
7  27.6  26.4  53.8  88.8  68.5
8  96.6  96.4  53.4  72.4  50.1
9  73.7  39.0  43.2  81.6  34.7

### 5. Rename the data frame columns based on the names in the list below.

In [4]:
b = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

In [9]:
colnames = ['Score_1', 'Score_2', 'Score_3', 'Score_4', 'Score_5']

In [10]:
dataframe_with_columns = pd.DataFrame(b, columns=['Score_1', 'Score_2', 'Score_3', 'Score_4', 'Score_5'])

### 6. Create a subset of this data frame that contains only the Score 1, 3, and 5 columns.

In [11]:
dataframe_1_3_5 = dataframe_with_columns[["Score_1", "Score_3", "Score_5"]].shape

### 7. From the original data frame, calculate the average Score_3 value.

In [12]:
avg_score_3 = dataframe_with_columns["Score_3"].mean()
print(avg_score_3)

56.95000000000001

### 8. From the original data frame, calculate the maximum Score_4 value.

In [13]:
max_score_4 = dataframe_with_columns["Score_4"].max()
print(max_score_4)

88.8

### 9. From the original data frame, calculate the median Score 2 value.

In [14]:
median_score_2 = dataframe_with_columns["Score_2"].median()
print(median_score_2)

40.75

### 10. Create a Pandas DataFrame from the dictionary of product orders below.

In [16]:
orders = {'Description': ['LUNCH BAG APPLE DESIGN',
  'SET OF 60 VINTAGE LEAF CAKE CASES ',
  'RIBBON REEL STRIPES DESIGN ',
  'WORLD WAR 2 GLIDERS ASSTD DESIGNS',
  'PLAYING CARDS JUBILEE UNION JACK',
  'POPCORN HOLDER',
  'BOX OF VINTAGE ALPHABET BLOCKS',
  'PARTY BUNTING',
  'JAZZ HEARTS ADDRESS BOOK',
  'SET OF 4 SANTA PLACE SETTINGS'],
 'Quantity': [1, 24, 1, 2880, 2, 7, 1, 4, 10, 48],
 'UnitPrice': [1.65, 0.55, 1.65, 0.18, 1.25, 0.85, 11.95, 4.95, 0.19, 1.25],
 'Revenue': [1.65, 13.2, 1.65, 518.4, 2.5, 5.95, 11.95, 19.8, 1.9, 60.0]}

In [17]:
df_orders = pd.DataFrame(orders)
print(df_orders)

                          Description  Quantity  UnitPrice  Revenue
0              LUNCH BAG APPLE DESIGN         1       1.65     1.65
1  SET OF 60 VINTAGE LEAF CAKE CASES         24       0.55    13.20
2         RIBBON REEL STRIPES DESIGN          1       1.65     1.65
3   WORLD WAR 2 GLIDERS ASSTD DESIGNS      2880       0.18   518.40
4    PLAYING CARDS JUBILEE UNION JACK         2       1.25     2.50
5                      POPCORN HOLDER         7       0.85     5.95
6      BOX OF VINTAGE ALPHABET BLOCKS         1      11.95    11.95
7                       PARTY BUNTING         4       4.95    19.80
8            JAZZ HEARTS ADDRESS BOOK        10       0.19     1.90
9       SET OF 4 SANTA PLACE SETTINGS        48       1.25    60.00

### 11. Calculate the total quantity ordered and revenue generated from these orders.

In [18]:
total_quantity = df_orders["Quantity"].sum()
print(total_quantity)
revenue = df_orders["Revenue"].sum()
print(revenue)

2978
637.0

### 12. Obtain the prices of the most expensive and least expensive items ordered and print the difference.

In [19]:
most_expensive = df_orders["UnitPrice"].max()
least_expensive = df_orders["UnitPrice"].min()
difference = most_expensive - least_expensive
print(difference)

11.77

## Let's load another dataset for more exercisesÂº

In [136]:
# Run this code:
admissions = pd.read_csv('../Admission_Predict.csv')
#to remove trailing spaces at the end of the column names
admissions.columns = admissions.columns.str.rstrip()

Let's evaluate the dataset by looking at the `head` function.

In [137]:
admissions.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,316,104,3,3.0,3.5,8.00,1,0.72
2,3,322,110,3,3.5,2.5,8.67,1,0.80
3,4,314,103,2,2.0,3.0,8.21,0,0.65
4,5,330,115,5,4.5,3.0,9.34,1,0.90

### 1 - Before beginning to work with this dataset and evaluating graduate admissions data, we will verify that there is no missing data in the dataset. Do this in the cell below.

In [138]:
admissions.isna().sum()

Serial No.           0
GRE Score            0
TOEFL Score          0
University Rating    0
SOP                  0
LOR                  0
CGPA                 0
Research             0
Chance of Admit      0
dtype: int64

###  2 -  Interestingly, there is a column that uniquely identifies the applicants. This column is the serial number column. Instead of having our own index, we should make this column our index. Do this in the cell below. Keep the column in the dataframe in addition to making it an index.

In [139]:
admissions.columns

Index(['Serial No.', 'GRE Score', 'TOEFL Score', 'University Rating', 'SOP',
       'LOR', 'CGPA', 'Research', 'Chance of Admit'],
      dtype='object')

In [140]:
admissions.set_index("Serial No.", inplace=True)
admissions.head()

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,316,104,3,3.0,3.5,8.00,1,0.72
3,322,110,3,3.5,2.5,8.67,1,0.80
4,314,103,2,2.0,3.0,8.21,0,0.65
5,330,115,5,4.5,3.0,9.34,1,0.90

In [141]:
admissions.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            376, 377, 378, 379, 380, 381, 382, 383, 384, 385],
           dtype='int64', name='Serial No.', length=385)

Turns out that `GRE Score` and `CGPA` also uniquely identify the data. Show this in the cell below.

In [173]:
admissions.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 385 entries, 1 to 385
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   GRE Score          385 non-null    int64
 1   TOEFL Score        385 non-null    int64
 2   University Rating  385 non-null    int64
 3   SOP                385 non-null    float64
 4   LOR                385 non-null    float64
 5   CGPA               385 non-null    float64
 6   Research           385 non-null    int64
 7   Chance of Admit    385 non-null    float64
dtypes: float64(4), int64(4)
memory usage: 35.2 KB

In [162]:
admissions['GRE Score'].nunique()

49

In [163]:
admissions['CGPA'].nunique()

168

In [164]:
admissions_1 = admissions.copy()

In [170]:
admissions_1["check"] = admissions["GRE Score"].astype(float) + admissions["CGPA"]
admissions_1.head()

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit,check
Serial No.,,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92,346.65
2,316,104,3,3.0,3.5,8.00,1,0.72,324.00
3,322,110,3,3.5,2.5,8.67,1,0.80,330.67
4,314,103,2,2.0,3.0,8.21,0,0.65,322.21
5,330,115,5,4.5,3.0,9.34,1,0.90,339.34

In [172]:
admissions_1['check'].nunique()

380

In [ ]:
#None of these categories can uniquely identify the data, even when they are combined.

### 3 - In this part of the lab, we would like to test complex conditions on the entire data set at once. Let's start by finding the number of rows where the CGPA is greater than 9 and the student has performed an investigation.

In [146]:
filter_1 = admissions.loc[(admissions["CGPA"] > 9) & (admissions["Research"] >= 1)]
filter_1.head()
filter_1.count()

GRE Score            101
TOEFL Score          101
University Rating    101
SOP                  101
LOR                  101
CGPA                 101
Research             101
Chance of Admit      101
dtype: int64

#### 4 - Now return all the rows where the CGPA is greater than 9 and the SOP score is less than 3.5. Find the mean chance of admit for these applicants.

In [147]:
filter_2 = admissions.loc[(admissions["CGPA"] > 9) & (admissions["SOP"] < 3.5)]
filter_2.head()
filter_2.count()

GRE Score            5
TOEFL Score          5
University Rating    5
SOP                  5
LOR                  5
CGPA                 5
Research             5
Chance of Admit      5
dtype: int64

In [148]:
filter_2.mean() #Mean = 0.802

GRE Score            328.000
TOEFL Score          112.800
University Rating      3.400
SOP                    3.000
LOR                    3.400
CGPA                   9.130
Research               0.800
Chance of Admit        0.802
dtype: float64

Let's create a new column based on the TOEFL Score column, where we put True if the TOEFL value is greater than 100 and False if it is less. We are going to do it with a function and an apply. 
To do this, we first create a function that receives an argument. The function will return True if the parameter entered is greater than 100, otherwise it will return False.

In [149]:
def toefl_yes(x):
    if x > 100:
        return True
    else:
        return False

Now we create a new column called "Decision" and apply to the TOEFL Score column

In [104]:
admissions["Decision"] = admissions["TOEFL Score"].apply(toefl_yes)

In [150]:
admissions.head()

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,316,104,3,3.0,3.5,8.00,1,0.72
3,322,110,3,3.5,2.5,8.67,1,0.80
4,314,103,2,2.0,3.0,8.21,0,0.65
5,330,115,5,4.5,3.0,9.34,1,0.90

Create a column called `decision2` in the `admissions` dataframe. Assign 1 to this column if the value of `SOP` is greater than 3 and 0 otherwise.    
HINT (use np.where)

In [151]:
a = admissions["SOP"]
#decision2 = np.where(a > 3, a, 1)

In [157]:
admissions_2 = admissions.copy()

In [158]:
admissions_2["decision2"] = np.where(a > 3, 1, 0)

In [131]:
admissions_2.head()

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit,Decision,decision2
Serial No.,,,,,,,,,,
1,337.0,118.0,4.0,4.5,4.5,9.65,1.0,0.92,1.0,1
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0
3,322.0,110.0,3.0,3.5,2.5,8.67,1.0,0.80,1.0,1
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0
5,330.0,115.0,5.0,4.5,3.0,9.34,1.0,0.90,1.0,1